using Tyuiu.MilyutinND.Sprint2.Task1.V22.Lib;
//Написать программу из операций сравнений (==, !=, <, >, <=, >=, последовательность можно чередовать, но использовать один раз в выражении)
//и логических операций (|, &, ||, &&, !, ^, последовательность операций не должна нарушаться), а также арифметических выражений,
//которая вернет логическую последовательность(массив): (True, True, True, False, False, False), при a = 324, b = 696, c = 254, d = 155
Console.Title = "Спринт #2 | Выполнил: Милютин Н. Д. | СМАРТб-24-1";
Console.WriteLine("***************************************************************************");
Console.WriteLine("* Спринт #2                                                               *");
Console.WriteLine("* Тема: Операции сравнения                                                *");
Console.WriteLine("* Задание #1                                                              *");
Console.WriteLine("* Вариант #22                                                             *");
Console.WriteLine("* Выполнил: Милютин Никита Дмитриевич | СМАРТб-24-1                       *");
Console.WriteLine("***************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                *");
Console.WriteLine("* Написать программу из операций сравнений (==, !=, <, >, <=, >=, последо-*");
Console.WriteLine("* вательность можно чередовать, но использовать один раз в выражении)     *");
Console.WriteLine("* и логических операций (|, &, ||, &&, !, ^, последовательность операций  *");
Console.WriteLine("* не должна нарушаться), а также арифметических выражений, которая вернет *");
Console.WriteLine("* логическую последовательность(массив): (True, True, True, False, False, *");
Console.WriteLine("* False), при a = 324, b = 696, c = 254, d = 155                          *");
Console.WriteLine("***************************************************************************");

DataService ds = new DataService();
int a = 324;
int b = 696;
int c = 254;
int d = 155;
bool[] res = new bool[6];
res = ds.GetLogicOperations(a,b,c,d);

Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                        *");
Console.WriteLine("***************************************************************************");

Console.WriteLine("a = " + a);
Console.WriteLine("b = " + b);
Console.WriteLine("c = " + c);
Console.WriteLine("d = " + d);

Console.WriteLine("***************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
Console.WriteLine("***************************************************************************");

for (int i = 0; i < 6; i++)
{
    Console.WriteLine(res[i]);
}
Console.ReadKey();
